doc/config/crappy.startup.bindings.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>crappy.startup.bindings</title>
<!-- 2014-10-29 Wed 15:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Andrew Phillips" />
</head>
<body>
<div id="content">
<h1 class="title">crappy.startup.bindings</h1>
<p>
Assign keyboard and mouse buttons to functions.  Uses the ezconfig library by Georgi Valkov to describe the binding using a string.  The modifiers <code>M</code> (modkey), <code>A</code> (alt), <code>S</code> (shift) and <code>C</code> (control) can be combined using a <code>-</code> with a key name for a key or mouse button combination.
</p>

<p>
Settings:
</p>
<ul class="org-ul">
<li><code>modkey</code> - The name of the key to use for "M", defaults to Mod4  (windows key).
</li>
<li><code>modkey</code> - The name of the key to use for "A", defaults to Mod1 (Alt key).
</li>
<li><code>buttons</code> - The mapping of mouse buttons to functions
<ul class="org-ul">
<li><code>root</code> - Mouse buttons that apply to the root window
</li>
<li><code>client</code> - Mouse buttons that apply to client windows.  The functions are called with the client as an argument.
</li>
</ul>
</li>
<li><code>keys</code> - The mapping of keyboard keys to functions
<ul class="org-ul">
<li><code>global</code> - Keys that work everywhere
</li>
<li><code>client</code> - Keys that work on client windows.  The functions are called with the client as an argument.
</li>
</ul>
</li>
</ul>

<p>
Example:
</p>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #ffa07a;">"settings"</span>: {
    <span style="color: #ffa07a;">"modkey"</span>: <span style="color: #ffa07a;">"Mod4"</span>,
    <span style="color: #ffa07a;">"altkey"</span>: <span style="color: #ffa07a;">"Mod1"</span>,
    <span style="color: #ffa07a;">"buttons"</span>: {
        <span style="color: #ffa07a;">"root"</span>: {
            <span style="color: #ffa07a;">"3"</span>: <span style="color: #ffa07a;">"crappy.functions.menu.toggle"</span>,
            <span style="color: #ffa07a;">"4"</span>: <span style="color: #ffa07a;">"awful.tag.viewnext"</span>,
            <span style="color: #ffa07a;">"5"</span>: <span style="color: #ffa07a;">"awful.tag.viewprev"</span>
        },
        <span style="color: #ffa07a;">"client"</span>: {
            <span style="color: #ffa07a;">"1"</span>: <span style="color: #ffa07a;">"crappy.functions.client.focus"</span>,
            <span style="color: #ffa07a;">"2"</span>: <span style="color: #ffa07a;">"crappy.functions.client.focus"</span>,
            <span style="color: #ffa07a;">"3"</span>: <span style="color: #ffa07a;">"crappy.functions.client.focus"</span>,
            <span style="color: #ffa07a;">"M-1"</span>: <span style="color: #ffa07a;">"awful.mouse.client.move"</span>,
            <span style="color: #ffa07a;">"M-3"</span>: <span style="color: #ffa07a;">"awful.mouse.client.resize"</span>
        }
    },
    <span style="color: #ffa07a;">"keys"</span>: {
        <span style="color: #ffa07a;">"global"</span>: {
            <span style="color: #ffa07a;">"M-&lt;Left&gt;"</span>: <span style="color: #ffa07a;">"awful.tag.viewprev"</span>,
            <span style="color: #ffa07a;">"M-&lt;Right&gt;"</span>: <span style="color: #ffa07a;">"awful.tag.viewnext"</span>,
            <span style="color: #ffa07a;">"M-&lt;Escape&gt;"</span>: <span style="color: #ffa07a;">"awful.tag.history.restore"</span>,

            <span style="color: #ffa07a;">"M-j"</span>: <span style="color: #ffa07a;">"crappy.functions.global.focusNext"</span>,
            <span style="color: #ffa07a;">"M-k"</span>: <span style="color: #ffa07a;">"crappy.functions.global.focusPrev"</span>,
            <span style="color: #ffa07a;">"M-w"</span>: <span style="color: #ffa07a;">"crappy.functions.global.showMenu"</span>,
            <span style="color: #ffa07a;">"M-&lt;Tab&gt;"</span>: <span style="color: #ffa07a;">"crappy.functions.global.focusNext"</span>,
            <span style="color: #ffa07a;">"M-`"</span>: <span style="color: #ffa07a;">"crappy.functions.global.focusPrevHist"</span>,

                ...

            <span style="color: #ffa07a;">"M-p"</span>: <span style="color: #ffa07a;">"menubar.show"</span>
        },
        <span style="color: #ffa07a;">"client"</span>: {
            <span style="color: #ffa07a;">"M-f"</span>: <span style="color: #ffa07a;">"crappy.functions.client.fullscreen"</span>,
            <span style="color: #ffa07a;">"M-S-c"</span>: <span style="color: #ffa07a;">"crappy.functions.client.kill"</span>,
            <span style="color: #ffa07a;">"M-C-&lt;space&gt;"</span>: <span style="color: #ffa07a;">"awful.client.floating.toggle"</span>,
            <span style="color: #ffa07a;">"M-C-&lt;Return&gt;"</span>: <span style="color: #ffa07a;">"crappy.functions.client.swapMaster"</span>,
            <span style="color: #ffa07a;">"M-o"</span>: <span style="color: #ffa07a;">"awful.client.movetoscreen"</span>,
            <span style="color: #ffa07a;">"M-r"</span>: <span style="color: #ffa07a;">"crappy.functions.client.redraw"</span>,
            <span style="color: #ffa07a;">"M-t"</span>: <span style="color: #ffa07a;">"crappy.functions.client.ontop"</span>,
            <span style="color: #ffa07a;">"M-n"</span>: <span style="color: #ffa07a;">"crappy.functions.client.minimized"</span>,
            <span style="color: #ffa07a;">"M-m"</span>: <span style="color: #ffa07a;">"crappy.functions.client.maximized"</span>
        }
    }
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Andrew Phillips &lt;<a href="mailto:theasp@gmail.com">theasp@gmail.com</a>&gt;</p>
<p class="date">Date: 2014-10-29 Wed 15:01</p>
</div>
</body>
</html>
